In [4]:
hours = [15, 27, 37, 36, 44, 17, 47, 34, 40, 49, 24, 46, 42, 50, 47, 39, 44, 49, 20, 48, 19, 44, 53, 50, 54, 54, 15, 53, 47, 20, 35,
32, 16, 49, 27, 30, 34, 24, 52, 36, 42, 33, 50, 42, 52, 54, 27, 40, 38, 44]
print(hours)
sorted(hours, reverse = True)
min(hours)
max(hours)
sum(hours)
sum(hours)/len(hours)
moreThan34 = [x for x in hours if x >34]
lessThan34 =[x for x in hours if x <34]

[15, 27, 37, 36, 44, 17, 47, 34, 40, 49, 24, 46, 42, 50, 47, 39, 44, 49, 20, 48, 19, 44, 53, 50, 54, 54, 15, 53, 47, 20, 35, 32, 16, 49, 27, 30, 34, 24, 52, 36, 42, 33, 50, 42, 52, 54, 27, 40, 38, 44]

In [12]:
import numpy as np 
import pandas as pd
s1 = pd.Series([1,2,3])
s2 = pd.Series ([4,8,5])
s3 = pd.Series (["CN","PL","DE"])

In [18]:
group = pd.DataFrame([s1,s2,s3])
group

    0   1   2
0   1   2   3
1   4   8   5
2  CN  PL  DE

In [24]:
group.index = ["ID","GRADE","COUNTRY"]

In [25]:
group

          0   1   2
ID        1   2   3
GRADE     4   8   5
COUNTRY  CN  PL  DE

In [26]:
group.columns = ["A","B","C"]

In [27]:
group

          A   B   C
ID        1   2   3
GRADE     4   8   5
COUNTRY  CN  PL  DE

In [28]:
group["B"]

ID          2
GRADE       8
COUNTRY    PL
Name: B, dtype: object

In [29]:
import seaborn as sns
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic',
 'anagrams',
 'anagrams',
 'anscombe',
 'anscombe',
 'attention',
 'attention',
 'brain_networks',
 'brain_networks',
 'car_crashes',
 'car_crashes',
 'diamonds',
 'diamonds',
 'dots',
 'dots',
 'dowjones',
 'dowjones',
 'exercise',
 'exercise',
 'flights',
 'flights',
 'fmri',
 'fmri',
 'geyser',
 'geyser',
 'glue',
 'glue',
 'healthexp',
 'healthexp',
 'iris',
 'iris',
 'mpg',
 'mpg',
 'penguins',
 'penguins',
 'planets',
 'planets',
 'seaice',
 'seaice',
 'taxis',
 'taxis',
 'tips',
 'tips',
 'titanic',
 'titanic',
 'anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [30]:
df1_3 =sns.load_dataset("mpg")

In [31]:
df1_3

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10

In [32]:
type(df1_3)

pandas.core.frame.DataFrame

In [33]:
df1_3.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [34]:
len(df1_3)

398

In [36]:
df1_3.shape

(398, 9)

In [37]:
df1_3["horsepower"]

0      130.0
1      165.0
2      150.0
3      150.0
4      140.0
       ...
393     86.0
394     52.0
395     84.0
396     79.0
397     82.0
Name: horsepower, Length: 398, dtype: float64

In [38]:
df1_3["weight"].mean()

2970.424623115578

In [41]:
df1_4 = pd.read_excel("D:\dataLab\DataL1_4.xls")
df1_4.columns

Index(['Y', 'X1', 'X2', 'Rok'], dtype='object')

In [43]:
df1_4["Y"].mean()
df1_4["Y"].max()
df1_4["Y"].min()

1666